Page({
  onLoad(options) {
    this.setData({
      memoIndex: Number(options.index)
    })
  },

  data: {
    memoIndex: 0,
    memo: [{
      'title': '用户服务协议',
      'content': `
      欢迎您使用铲屎官，铲屎官是一款宠物社交服务APP。为保证您的权益，便于更好地使用铲屎官及相应的配套服务，请您务必在注册前认真阅读本协议，若您阅读并接受本协议，使用铲屎官提供的产品和服务，即视为您受本协议的约束，若您不同意本协议，请勿使用本网站任何产品和服务。
      
      一、服务内容
      铲屎官运用自己的系统通过互联网络为用户提供商品出售服务。用户使用本服务需要下载铲屎官客户端软件，同时，用户必须：
      1、自行配备上网所需设备，包括个人电脑、调制解调器或其他必备上网装置。
      2、自行负担个人上网所支付的与此服务有关的电话费用、网络费用。
      3、基于铲屎官所提供的服务的重要性，用户应同意：
      1）提供详尽、准确的个人资料。
      2）不断更新注册资料，符合及时、详尽、准确的要求，如果您提供的注册资料不合法、不真实的，需自行承担由此引起的责任及后果，本公司保留终止您使用铲屎官各项服务的权利。
      4、为防止他人冒用您的身份注册、使用本服务，铲屎官可能会给您的手机发送短信进行验证，由此产生的短信费用由本公司支付，您不需支付任何费用。
      
      二、服务的提供、修改及终止
      1、您保证在您同意接受本协议并成为铲屎官用户时，您是具备完全民事权利能力和完全民事行为能力的自然人。
      2、在接受本公司各项服务的同时，您同意接受本公司提供的各类信息服务，并在此授权本公司可以向您电子邮件、手机等发送商业信息。
      3、您有权选择不接受本公司提供的各类信息服务。
      4、本公司可以提前3天通知，单方终止本协议。
      5、铲屎官有权在必要时修改服务条款，若您对本协议的修改有异议，您可以停止使用铲屎官的网络服务，在此情况下，铲屎官没有义务传送任何未处理的信息或未完成的服务给您或任何无直接关联的第三方。
      
      三、用户隐私制度
      1、本公司将会采取合法、合理的措施保护用户的个人信息，非经法定原因或用户事先许可，本公司不会向任何第三方透露您的密码、姓名、手机号码等非公开信息。以下情况除外：
      1）用户授权铲屎官透露这些信息。
      2）相关的法律法规或监管机构、司法机构要求铲屎官提供您的个人资料；国家司法机关符合法律规定并经法定程序的检查及其他操作。
      3）任何第三方盗用、冒用或未经许可擅自披露、使用或对外公开您的个人隐私资料。
      4）由您要求网站提供特定服务时，需要把您的姓名和地址提供给第三方的
      。
      5）您在使用本服务、参加网站活动或访问网站网页时，自动接收并记录的浏览器端或手机客户端数据，包括但不限于IP地址、网站Cookie中的资料及您要求取用的网页记录。
      6）铲屎官从商业伙伴处合法获取的个人信息。
      2、在适合的情况下，并在您同意的前提下，我们会利用您的信息来联络您，为您发送信息。
      3、您应当妥善保管您的设备和密码及身份信息，对于因密码泄露、身份信息泄露、设备丢失所致的损失，由您自行承担。
      
      四、用户行为规范
      除非法律允许或本公司书面许可，您使用本软件过程中不得从事下列行为：
      1、删除本软件及其副本上关于著作权的信息。
      2、对本软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现本软件的源代码。
      3、对本公司拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等。
      4、对本软件或者本软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及本软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非本公司经授权的第三方工具/服务接入本软件和相关系统。
      5、通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的。
      6、通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的。
      7、自行或者授权他人、第三方软件对本软件及其组件、模块、数据进行干扰。
      8、其他未经本公司明示授权的行为。
      
      五、适用法律和管辖权
      1、铲屎官注册所在地法律、法规应规范本协议以及本协议各方之间引起的争议，除非存在法律指定适用其他管辖法律。
      2、在合约一方寻求实现本协议下的权利，或寻求宣告本协议下的任何权利或义务的任何民事诉讼或其他诉讼过程中，各合约方应承担其代理律师的费用和支出。
      3、本协议的解释语言应为中文。
      4、本公司可能通过多种语言将本协议或任何其他文件、信息和消息提供给合作方。本协议规定，合作方应当承认及确认本公司工作语言为中文。如果任何文件、信息和消息的非中文表述和中文表述之间出现矛盾和不一致的情况下，双方将以中文文件、信息和消息为标准。
      
      六、免责条款
      1、铲屎官旨在为客户提供宠物相关服务，平台不对您个人损失负责，也不会对因为您使用个人系统交易而产生的费用和开支负责。
      2、由于电信运营商提供的通信线路等原因造成的以及由不可抗力造成的暂时性不能或者部分不能提供服务的，平台不承担任何责任。
      3、任何由于黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常经营的不可抗力而造成的个人资料泄露、丢失、被盗用或被窜改等。
      4、本软件上有与其他网站网页的链接。本软件对其他任何网站的内容、隐私政策或运营，或经营这些网站的公司的行为概不负责。在向这些与本软件链接的网站提供个人信息之前，请查阅它们的隐私政策。
      5、由于与本软件链接的其它网站所造成之个人资料泄露及由此而导致的任何法律争议和后果。
      6、除本软件注明之服务条款外，其它因使用本软件而引致之任何意外损失（包括因下载而感染电脑病毒）、名誉权或知识产权受到侵犯。

      本软件之声明的修改及更新权均属于铲屎官。
      `
    },{
      title: '隐私政策',
      content: `
      我们承诺严格遵守法律法规，遵循以下隐私保护原则，为您提供更加安全、可靠的服务：

      一、我们可能收集的信息
      （一）与个人身份无关的信息：
      当您使用我们的服务时，我们可能收集和汇总诸如用户的来源途径、访问顺序等信息，例如记录使用服务的每个用户的来源途径、浏览器软件等。
      （二）有关个人身份的信息：
      当您使用服务时，我们可能收集和汇总或要求您提供有关个人身份的信息，例如个人身份证明（包括身份证、护照、驾驶证等）；生日、籍贯、性别、兴趣爱好、个人电话号码、面部特征；网络身份标识信息（包括系统账号、IP地址、电子邮箱地址及与前述有关的密码、口令、口令保护答案等）；个人财产信息（交易记录、余额、优惠券、游戏类兑换码、银行卡信息等）；通讯信息；个人上网记录和日志信息（包括网站浏览记录、软件使用记录、点击记录、操作日志等）；设备信息（包括设备型号、设备MAC地址、操作系统类型、设备设置）；软件列表唯一设备识别码（如IMEI/androidID/IDFA/OPENUDID/GUID、SIM卡IMSI信息等在内的描述个人常用设备基本情况的信息）；位置信息（包括行程信息、精准定位信息、住宿信息、经纬度等）。
      我们收集您的信息主要是为了您和其他用户能够更容易和更满意地使用服务。我们的目标是向所有的互联网用户提供安全、刺激、有趣及有教益的上网经历。而这些信息有助于我们实现这一目标。

      二、我们如何收集和使用信息
      （一）我们将通过以下途径收集和获得您的信息：
      1、您提供的信息。 例如：
      （1）您在注册服务帐号或使用服务时，向我们提供的信息；
      （2）您通过我们的服务向其他方提供的共享信息，以及您使用服务时所储存的信息。
      2、其他方分享的您的信息。亦即其他方使用我们的服务时所提供有关您的共享信息。
      3、我们获取的您的信息。您在使用我们的服务时，我们收集、汇总、记录的信息，例如日志信息、位置信息、设备信息等。
      （二）COOKIES、日志档案和WEBBEACON
      我们或我们的第三方合作伙伴可能通过COOKIES和WEB BEACON获取和使用您的信息，并将该等信息储存为日志信息。
      通过使用COOKIES，我们向用户提供简单易行并富个性化的网络体验。一个COOKIES是少量的数据，它们从一个网络服务器送至您的浏览器并存在计算机硬盘上。我们使用COOKIES是为了让其用户可以受益。比如，为使得虚拟社区的登录过程更快捷，您可以选择把用户名存在一个COOKIES中。这样下次当您要登录我们的服务时能更加方便快捷。COOKIES能帮助我们确定您连接的页面和内容，您在特定服务上花费的时间和您所选择的服务。
      COOKIES使得我们能更好、更快地为您服务，并且使您在服务上的经历更富个性化。然而，您应该能够控制COOKIES是否以及怎样被你的浏览器接受。请查阅您的浏览器附带的文件以获得更多这方面的信息。
      我们和第三方合作伙伴可能通过COOKIES和WEB BEACON收集和使用您的信息，并将该等信息储存。
      我们使用自己的COOKIES和WEBBEACON，用于以下用途：
      （1）记住您的身份。例如：COOKIES和WEB BEACON有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供有关您的喜好或其他信息；
      （2）分析您使用我们服务的情况。我们可利用COOKIES和WEB BEACON来了解您使用服务进行什么活动、或哪些服务或服务最受欢迎；
      （3）广告优化。COOKIES和WEB BEACON有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放。
      我们为上述目的使用COOKIES和WEB BEACON的同时，可能将通过COOKIES和WEB BEACON收集的非个人身份信息汇总提供给广告商和其他伙伴，用于分析您和其他用户如何使用服务并用于广告服务。
      服务上可能会有广告商和其他合作方放置的COOKIES和WEB BEACON。这些COOKIES和WEB BEACON可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方COOKIES和WEB BEACON收集和使用该等信息不受本《隐私政策》约束，而是受到其自身的个人信息保护声明约束，我们不对第三方的COOKIES或WEB BEACON承担责任。
      您可以通过浏览器或用户选择机制拒绝或管理COOKIES或WEB BEACON。但请您注意，如果您停用COOKIES或WEB BEACON，我们有可能无法为您提供最佳的服务体验，某些服务也可能无法正常使用。同时，您仍然将收到广告，只是这些广告与您的相关性会降低。
      （三）我们会出于以下目的，收集和使用您的信息：
      1、帮助您完成注册
      为便于我们为您提供服务，您需要提供基本注册信息，例如手机号码、电子邮箱地址等，并创建您的用户名和密码。在部分单项服务中，如果您仅需使用浏览、搜索等基本服务，您不需要注册成为我们的用户及提供上述信息。
      2、向您提供商品或服务
      我们所收集和使用的信息是为您提供服务的必要条件，如缺少相关信息，我们将无法为您提供服务的核心内容，例如：
      （1）在部分服务项目中，为便于向您交付商品或服务，您需提供收货人个人身份信息、姓名、收货地址、邮政编码、收货人、联系电话、支付状态等信息。如果您拒绝提供此类信息，我们将无法完成相关交付服务。如您通过我们的服务为其他人订购商品或服务，您需要提供该实际订购人的前述信息。向我们提供该实际订购人的前述信息之前，您需确保您已经取得其授权同意。
      （2）为展示您账户的订单信息，我们会收集您在使用我们的服务过程中产生的订单信息用于向您展示及便于您对订单进行管理；
      （3）当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。
      （4）为确认交易状态及为您提供售后与争议解决服务，我们会通过您基于交易所选择的交易对象、支付机构、物流公司等收集与交易进度相关的您的交易、支付、物流信息，或将您的交易信息共享给上述服务提供者。
      3、向您推送消息
      （1）为您展示和推送商品或服务。我们可能使用您的信息，您的浏览及搜索记录、设备信息、位置信息、订单信息，提取您的浏览、搜索偏好、行为习惯、位置信息等特征，并基于特征标签通过电子邮件、短信或其他方式向您发送营销信息，提供或推广我们或第三方的如下商品和服务：
      我们的商品和服务，包括但不限于：即时通讯服务、网上媒体服务、互动娱乐服务、社交网络服务、支付服务、互联网搜索服务、位置和地图服务、应用软件和服务、数据管理软件和服务、网上广告服务、互联网金融及其他社交媒体、娱乐、网络游戏、电子商务、资讯及通讯软件和服务（“互联网服务”）；以及
      第三方商品和服务，包括但不限于：互联网服务、食物和餐饮、体育、音乐、电影、电视、现场表演和其他艺术和娱乐、书册、杂志和其他刊物、服装和配饰、珠宝、化妆品、个人健康和卫生、电子、收藏品、家用器皿、电器、家居装饰和摆设、宠物、汽车、酒店、交通和旅游、银行、保险及金融服务、积分和奖励计划，以及我们认为可能与您相关的其他商品和服务。
      （2）向您发出通知。我们可能在必需时（例如当我们由于系统维护而暂停某一单项服务、变更、终止提供某一单项服务时）向您发出与服务有关的通知。
      如您不希望继续接收我们推送的消息，您可要求我们停止推送，例如：根据短信退订指引要求我们停止发送推广短信，或在移动端设备中进行设置，不再接收我们推送的消息等；但我们依法律规定或单项服务的服务协议约定发送消息的情形除外。
      4、为您提供安全保障
      为确保您身份真实性、向您提供更好的安全保障，您可以向我们提供身份证明、面部特征等生物识别信息等个人敏感信息以完成实名认证。
      除身份验证外，我们可能将您的信息用于客户服务、安全防范、诈骗监测、存档和备份等用途，确保我们向您提供的服务的安全性；我们可能使用或整合我们所收集的您的信息，以及我们的合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。
      5、改进我们的服务
      我们可能将通过某一项服务所收集的信息，用于我们的其他服务。例如，在您使用某一项服务时所收集的您的信息，可能在另一项服务中用于向您提供特定内容或向您展示与您相关的、而非普遍推送的信息；我们可能让您参与有关服务的调查，帮助我们改善现有服务或设计新服务；同时，我们可能将您的信息用于软件更新。
      您了解并同意，在收集您的信息后，我们将通过技术手段对数据进行去标识化处理，去标识化处理的信息将无法识别您的身份，在此情况下我们有权使用已经去标识化的信息，对用户数据库进行分析并予以商业化的利用。
      如果我们将您的信息用于本《隐私政策》中未载明的其他用途，会事先征求您同意。
      6、征得授权同意的例外
      根据相关法律法规规定，以下情形中收集您的信息无需征得您的授权同意：
      （1）与国家安全、国防安全有关的；
      （2）与公共安全、公共卫生、重大公共利益有关的；
      （3）与犯罪侦查、起诉、审判和判决执行等有关的；
      （4）出于维护信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
      （5）所收集的信息是您自行向社会公众公开的；
      （6）从合法公开披露的信息中收集信息的，如合法的新闻报道、政府信息公开等渠道；
      （7）根据您的要求签订合同所必需的；
      （8）用于维护服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
      （9）为合法的新闻报道所必需的；
      （10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的信息进行去标识化处理的；
      （11）法律法规规定的其他情形。

      三、我们可能分享、转让或披露的信息
      （一）分享
      除以下情形外，未经您同意，我们不会与本公司之外的任何第三方分享您的信息：
      1、向您提供我们的服务。我们可能向合作伙伴及其他第三方分享您的信息，以实现您需要的核心功能或提供您需要的服务，例如：向物流服务商提供对应的订单信息；
      2、维护和改善我们的服务。我们可能向合作伙伴及其他第三方分享您的信息，以帮助我们为您提供更有针对性、更完善的服务，例如：代表我们发出电子邮件或推送通知的通讯服务提供商等；
      3、实现本《隐私政策》第二条“我们如何收集和使用信息”部分所述目的；
      4、履行我们在本《隐私政策》或我们与您达成的其他协议中的义务和行使我们的权利；
      5、向委托我们进行推广的合作伙伴等第三方共享，但我们仅会向这些委托方提供推广的覆盖面和有效性的信息，而不会提供可以识别您身份的信息，例如姓名电话号码或电子邮箱；或者我们将这些信息进行汇总，以便它不会识别您个人。比如我们可以告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客。
      6、在法律法规允许的范围内，为了遵守法律、维护我们及我们的关联方或合作伙伴、您或其他用户或社会公众利益、财产或安全免遭损害，比如为防止欺诈等违法活动和减少信用风险，我们可能与其他公司和组织交换信息。不过,这并不包括违反本《隐私政策》中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的信息。
      7、应您合法需求，协助处理您与他人的纠纷或争议；
      8、应您的监护人合法要求而提供您的信息；
      9、根据与您签署的单项服务协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供；
      10、基于学术研究而提供；
      11、基于符合法律法规的社会公共利益而提供。
      我们仅会出于合法、正当、必要、特定、明确的目的共享您的信息。对我们与之共享信息的公司、组织和个人，我们会与其签署严格的保密协定，要求他们按照我们的说明、本《隐私政策》以及其他任何相关的保密和安全措施来处理信息。
      （二）转让
      1、随着我们业务的持续发展，我们有可能进行合并、收购、资产转让或类似的交易，而您的信息有可能作为此类交易的一部分而被转移。我们会要求新的持有您信息的公司、组织继续受本《隐私政策》的约束，否则,我们将要求该公司、组织重新向您征求授权同意。
      2、在获得您的明确同意后，我们会向其他方转让您的信息。
      （三）披露
      我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，才会披露您的信息：
      1、根据您的需求，在您明确同意的披露方式下披露您所指定的信息；
      2、根据法律、法规的要求、强制性的行政执法或司法要求所必须提供您信息的情况下，我们可能会依据所要求的信息类型和披露方式披露您的信息。在符合法律法规的前提下，当我们收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持透明。我们对所有的请求都进行了慎重的审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。
      
      四、我们如何保留、储存和保护信息
      我们仅在本《隐私政策》所述目的所必需期间和法律法规要求的时限内保留您的信息。
      我们在中华人民共和国境内运营中收集和产生的信息，存储在中国境内。
      我们将采取以下手段保护您的信息：
      （一）数据安全技术措施
      我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的信息遭到未经授权的访问使用、修改,避免数据的损坏或丢失。网络服务采取了多种加密技术，例如在某些服务中，我们将利用加密技术（例如SSL）来保护您的信息，采取加密技术对您的信息进行加密保存，并通过隔离技术进行隔离。 在信息使用时，例如信息展示、信息关联计算，我们会采用多种数据脱敏技术增强信息在使用中安全性。采用严格的数据访问权限控制和多重身份认证技术保护信息，避免数据被违规使用。
      （二）我们为保护信息采取的其他安全措施
      我们通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范信息的存储和使用。
      我们通过信息接触者保密协议、监控和审计机制来对数据进行全面安全控制。
      加强安全意识。我们还会举办安全和隐私保护培训课程，加强员工对于保护信息重要性的认识。
      （三）我们仅允许有必要知晓这些信息的员工、合作伙伴访问您的信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您的信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与我方的合作关系。
      （四）我们会采取一切合理可行的措施，确保未收集无关的信息。
      （五）互联网并非绝对安全的环境，而且电子邮件、即时通讯、社交软件或其他服务软件等与其他用户的交流方式无法确定是否完全加密，我们建议您使用此类工具时请使用复杂密码，并注意保护您的信息安全。
      （六）互联网环境并非百分之百安全，我们将尽力确保或担保您发送给我们的任何信息的安全性。如果我们的物理、技术、或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改、或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
      （七）安全事件处置
      在通过我们的服务与第三方进行沟通或购买商品及服务时，您不可避免的要向交易对方或潜在的交易对方披露自己的信息，如联络方式或者邮政地址等。请您妥善保护自己的信息，仅在必要的情形下向他人提供。
      为应对信息泄露、损毁和丢失等可能出现的风险，我们制定了多项制度，明确安全事件、安全漏洞的分类分级标准及相应的处理流程。我们也为安全事件建立了专门的应急响应团队，按照安全事件处置规范要求，针对不同安全事件启动安全预案，进行止损、分析、定位、制定补救措施、联合相关部门进行溯源和打击。
      在不幸发生信息安全事件后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们同时将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报信息安全事件的处置情况。
      请您理解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。
      
      五、如何管理您的信息
      （一）访问、更新和删除
      我们鼓励您更新和修改您的信息以使其更准确有效。您能通过我们的服务访问您的信息，并根据对应信息的管理方式自行完成或要求我们进行修改、补充和删除。我们将采取适当的技术手段，尽可能保证您可以访问、更新和更正自己的信息或使用我们的服务时提供的其他信息。
      在访问、更新、更正和删除前述信息时，我们可能会要求您进行身份验证，以保障信息安全。对于通过COOKIES和WEB BEACON收集的您的信息，我们还在本《隐私政策》第二条“COOKIES、日志档案和WEB BEACON”部分说明了向您提供的选择机制。
      （二）公开与分享
      我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关信息，例如，您在服务中所上传或发布的信息、您对其他人上传或发布的信息作出的回应，通过电子邮件或在服务中不特定用户可见的公开区域内上传或公布您的个人信息，以及包括与这些信息有关的位置数据和日志信息。只要您不删除您所公开或共享的信息，有关信息可能一直留存在公众领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。如您将信息通过上述渠道公开或共享，由此造成您的信息泄露，我们不承担责任。因此，我们提醒并请您慎重考虑是否通过上述渠道公开或共享您的信息。
      （三）注销
      在符合单项服务的服务协议约定条件及国家相关法律法规规定的情况下，您的该项服务帐号可能被注销或删除。当帐号注销或被删除后，与该帐号相关的、该单项服务项下的全部服务资料和数据将依照单项服务的服务协议约定删除或处理。
      （四）改变您授权同意的范围
      您总是可以选择是否披露信息。有些信息是使用服务所必需的，但大多数其他信息的提供是由您决定的。您可以通过删除信息、关闭设备功能等方式改变您授权我们继续收集信息的范围或撤回您的授权。
      当您撤回授权后，我们无法继续为您提供撤回授权所对应的服务，也不再处理您相应的信息。但您撤回授权的决定，不会影响此前基于您的授权而开展的信息处理。
      （五）有关敏感信息的提示
      某些信息因其特殊性可能被认为是敏感信息，例如您的种族、宗教、个人健康和医疗信息等，以及身份证明文件、个人生物识别信息、财产信息、行踪轨迹、未成年人的信息等。
      请注意，您在服务中所提供、上传或发布的内容和信息（例如有关您社交活动的照片或信息），可能会泄露您的敏感信息。您需要谨慎地考虑，是否使用服务披露您的敏感信息。
      您同意您的敏感信息按本《隐私政策》所述的目的和方式来处理。
      
      六、第三方服务
      本服务可能链接至第三方提供的社交媒体或其他服务（包括网站或其他服务形式）。包括：
      （1）您可利用“分享”键将某些内容分享到其他服务，或您可利用第三方服务登录我们的服务。这些功能可能会收集您的信息（包括您的日志信息），并可能在您的电脑装置COOKIES，从而正常运行上述功能；
      （2）我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站；
      （3）其他接入第三方服务的情形。
      该等第三方社交媒体或其他服务由相关的第三方负责运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何信息），须受第三方自己的服务条款及信息保护声明（而非本《隐私政策》）约束，您需要仔细阅读其条款。本《隐私政策》仅适用于我们所收集的任何信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，而我们对任何第三方使用由您提供的信息不承担任何责任。
      
      七、年龄限制
      我们建议：任何未成年人参加网上活动应事先取得家长或其法定监护人（以下简称"监护人"）的同意。我们将根据国家相关法律法规的规定保护未成年人的相关信息。
      我们鼓励父母或监护人指导未成年人使用我们的服务。我们建议未成年人鼓励他们的父母或监护人阅读本《隐私政策》，并建议未成年人在提交信息之前寻求父母或监护人的同意和指导。
      
      八、通知和修订
      我们可能适时修改本《隐私政策》的条款，该等修改构成本《隐私政策》的一部分。对于重大变更，我们会提供更显著的通知，您可以选择停止使用我们的服务；在该种情况下，如您仍然继续使用我们的服务的，即表示同意受经修订的本《隐私政策》的约束。
      任何修改都会将您的满意度置于首位。我们鼓励您在每次使用我们的服务时都查阅我们的隐私政策。
      我们可能在必需时（例如当我们由于系统维护而暂停某一项服务时）发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。
      最后，您必须对您的账号和密码信息负有保密义务。任何情况下，请小心妥善保管。
      `
    }]
  },
})
